{
    "Title": "24. Singapore Symphony Orchestra Open House 2025",
    "Start Date": null,
    "End Date": null,
    "Time": "9am-6pm",
    "Address / Location": "11 Empress Place, #01-02, Singapore 179558",
    "Postal Code": "179558",
    "Category": null,
    "Price / Ticket Info": null,
    "Description": " 31st May  Image adapted from: Singapore Symphony Orchestra The Singapore Symphony Orchestra Open House is making its annual return with a variety of performances and activities for music lovers of all ages. Head down to check out all the happenings – from backstage tours to educational workshops and music performances. For instance, The Music Around You exhibition has free viewing for all and comprises a series of interactive musical installations around the venue. Collect all the stamps at the exhibits to bring home a secret SSO gift, limited to the first 200 redemptions. Naturally, you can also enjoy musical performances while you’re at the open house. The SOTA Malay Fusion Ensemble and Singapore Symphony Choruses will be performing at the atrium for free. Otherwise, catch a ticketed performance in the main concert hall by the Singapore National Youth Sinfonia and a string quartet from the Singapore Symphony Orchestra at prices starting from $10 . Image credit: Singapore Symphony Orchestra You can also engage in one of the many interactive workshops at the open house, such as the We Theremin Business workshop ($15/pax) , where you can learn about the theremin, an instrument played without any physical contact. After trying your hand at it, catch the Spatial Sounds ($15/pax) theremin performance and enjoy a special workshop and performance bundle price at 10% off. If not, the Make Some Noise! workshop gives you a glimpse into the art of foley and how sound effects are created in movies, television, and games. Last but not least, get an exclusive behind-the-scenes look of the historic Victoria Concert Hall through the SSO Backstage Tour ($25/pax) , or sign up for the Behind the Pipes: A Hands-On Organ Experience tour ($25/pax) – you’ll even get to create a miniature version of the majestic pipe organ! Tip: Students, seniors, NSFs, and PWDs can get a 50% discount off ticketed activities. Venue: 11 Empress Place, #01-02, Singapore 179558 Date: 31st May 2025 Time: 9am-6pm Find out more about SSO’s 2025 Open House . ",
    "Image URL(s)": [
        "https://thesmartlocal.com/wp-content/uploads/2025/04/Mirror-Mirror-Journey-Into-The-Mind.jpg"
    ],
    "Organizer": null,
    "Official Event Link": "https://www.sso.org.sg/sso-open-house?utm_source=tsl&utm_medium=listicle&utm_campaign=sso_open_house_2025",
    "url": [
        "https://thesmartlocal.com/read/things-to-do-this-weekend-singapore/"
    ]
}